app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE (title LIKE '%first%' OR text LIKE '%first%') ORDER BY created_at DESC

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["text", "this is first my article"], ["created_at", "2018-04-07 18:20:11.521206"], ["updated_at", "2018-04-07 18:20:11.521206"]]